# HardwoodColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Hardwood..::..HardwoodColor Property
Hardwood Class See Also
---
The property labeled "Image" from the "Hardwood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string HardwoodColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HardwoodColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ HardwoodColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
# See Also
Hardwood Class
Autodesk.Revit.DB.Visual Namespace